# Assignment1_rbasic
# Author: Daniel Wang

# ================ 课堂练习1
# 如何将3.141592657 转换成 character
as.character(3.141592657)
# 如何将3.141592657 转换成 logical
as.factor(3.141592657)
# 如何判断"hello world"是否是一个character
is.character("hello world")
# 如何判断一个NA是否是缺失值
is.na(NA)

# ================  课堂练习2
v1 = c(3,2,3,1)
# 取出v1的第2和第3个元素
v1[2:3]
# 取出v1的最后一个元素
length(v1)
v1[4]
# 取出v1的倒数第二个元素
v1[3]
# 取出v1中整除3的元素
v1%%3 == 0
v1[c(1,3)]
# v1[-1]会返回什么结果,有何启示?
v1[-1] # 删除第一个元素
# v1[5]会返回什么结果,有何启示?
v1[5] # 超过元素总数会返回缺失值
# v1[] <- 99 与 v1 <- 99 有何不同?
v1[5] <- 99 # 对v1中的元素进行更改
v1 <- 99 # 直接改变v1的变量

